"""
アプリケーションのメインウィンドウを作成するクラス

Author: Kenta Matsumura
"""
# ---------------------------------------------------------- #
# サードパーティライブラリのインポート
# ---------------------------------------------------------- #
import customtkinter as ctk
import pandas as pd

# ---------------------------------------------------------- #
# 自作ライブラリのインポート
# ---------------------------------------------------------- #
from common import *
from Tabview import Tabview
# ---------------------------------------------------------- #
# アプリケーションクラス
# ---------------------------------------------------------- #
class App(ctk.CTk):
    """
    アプリケーションのメインウィンドウを作成するクラス
    """    
    def __init__(self):
        super().__init__()
        """
        フォルダパスのタブ、データ確認用のタブを作成。 
        """
        # ---------------------------------------------------------- #
        # windowの設定
        # ---------------------------------------------------------- #
        self.title("データ解析ツール")
        self.state('zoomed')
        ctk.set_appearance_mode("dark")
        self.grid_rowconfigure(index=0, weight=1)
        self.grid_columnconfigure(index=0, weight=1)
        
        # ---------------------------------------------------------- #
        # 全クラス(ページ)で共通の変数
        # ---------------------------------------------------------- #
                
                
                
        # ---------------------------------------------------------- #
        # タブの作成
        # ---------------------------------------------------------- #
        self.tabview = Tabview(parent=self)
        self.tabview.grid(row=0, column=0, sticky=ctk.NSEW)
        self.tabview.grid_propagate(False) 

    # ---------------------------------------------------------- #
    # 全クラス(ページ)で共通の関数
    # ---------------------------------------------------------- #

        

        