"""
複数ファイル解析用クラス

Author: Kenta Matsumura
"""

# ---------------------------------------------------------- #
# サードパーティライブラリのインポート
# ---------------------------------------------------------- #
import customtkinter as ctk

# ---------------------------------------------------------- #
# 自作ライブラリのインポート
# ---------------------------------------------------------- #
from common import *

# ---------------------------------------------------------- #
# クラス定義
# ---------------------------------------------------------- #
class MultiFileAnalyzerFrame(ctk.CTkFrame):
    def __init__(self, parent):
        """
        複数ファイルの解析用クラス
        
        parameters
        ----------
            parent : ctk.CTkTabview 
                作成したフレームの格納先のタブ
        """
        super().__init__(master=parent)